let leaf;
let tree;
let nest;
let thoughts = ['Σε στίβες',
'πολλές στρώσεις από ζουμερά',
'που βγάζουνε αφρούς',
'Ξέρουν, ότι είναι μόνο σχηματάκια κάτω από τον χάρτη του υγρού,',
'κοιτάνε σαν ψάρια από κοντά',
'Και τα βλέπω που κοιτάνε τον αδένα μου',
'Γιατί πάνε να ξεφύγουν από μέσα τα καλώδια',
'Από τα σφιχτά',
'Ίσως αν χαλάσει να ξέρει πως να ξαναγίνει',
'λίγο έξω από την τρύπα',
'Εκεί στο μεταξύ,',
'και αγγίζουν τις συνδέσεις',
'στεριές, από μακριά, δίνουν φιλάκια',
'καταβράχηκαν μέχρι έξω από τα σάλια',
'που τα κολλάνε μεταξύ τους,',
'που τα κολλάνε μεταξύ τους',
'Και μας κοροϊδεύουν.',

'Περιμένουν τη σειρά τους, να πάνε για αραίωση ',
'της κόλλησης.',
'Με εργαλείο χειρός τη γιάντα ψάχνουν ',
'τις νέες κυκλοφορίες ',
'Και διανύουν έναν θόρυβο',
'Που ακούστηκε γύρω από το κόκαλο ',

'Για να ξαναγυρίσει στο συμβόλαιο.',
'10 βήματα μέσα στη σήραγγα',
'Θέλουν πλωτό προπονητή ',
'με σούπερ λειτουργία',
'το σύνδρομο της ανατάραξης',

'Ετυμολογίες, τσεπώνουν μαγνητάκια',
'Μέσα στους κανόνες που φεύγουν',
'για να συνδέσουν τα πηχτά από τη πίσω πόρτα',
'Η πιο βαιραλ πασαρέλα.',



'Χωρικός προσανατολισμός και πλοήγηση',
'στον τρισδιάστατο χώρο είναι πολύπλοκες ανθρώπινες δεξιότητες',
'που απαιτούν, μεταξύ άλλων,',
'παρακολούθηση της τρέχουσας θέσης του σώματος',
'με αναφορά σε προηγούμενες θέσεις στο περιβάλλον.',
'Ένα σύστημα χωρικής βραχυπρόθεσμης μνήμης',
'είναι πιθανό να εμπλέκεται στη διατήρηση',
'των διαδοχικών μετατοπίσεων του σώματος',
'που συμβαίνει κατά την πλοήγηση.',
'Ένα τέτοιο σύστημα είναι πιθανό να ενσωματωθεί',
'πολλαπλές αισθητηριακές εισροές',
'(οπτική, ιδιοδεκτική-σωματοαισθητήρια, αιθουσαία και ακουστική)',
'και να αλληλεπιδρούν με σχετικές χωρικές πληροφορίες',
'αποθηκεύεται στη μακροπρόθεσμη μνήμη.',
'Αυτά τα συστήματα χωρικής μνήμης είναι πιθανό',
'κάνουν χρήση πολλαπλών πλαισίων αναφοράς',
'κατά μήκος της εγωκεντρικής-αλλοκεντρικής διάστασης.',

'Μοιάζει με ένα τεράστιο έντομο με πολλά πόδια',
'οι μακριές κεραίες του συσπώνται ως απάντηση σε οποιοδήποτε',
'κίνηση γύρω του. Τα πόδια του καταλήγουν σε αιχμηρά άγκιστρα προσαρμοσμένα',
'για να τρυπώσει και να πιάσει το θήραμά του και το δυνατό του',
'Οι κάτω γνάθοι μπορούν να κόψουν ένα μικρό δέντρο στη μέση.',

'Eχουν συχνά ένα ή περισσότερα μηχανικά άκρα, ',
'όπως χέρια ή πόδια, τα οποία μπορούν να βελτιωθούν με προηγμένη τεχνολογία. ',
'Αυτά τα άκρα μπορεί να είναι ρομποτικά στην εμφάνιση, ',
'με μεταλλικές αρθρώσεις και συνθετικά υλικά.',


'έχουν συχνά διάφορες κυβερνητικές βελτιώσεις σε όλο το σώμα τους, ',
'όπως εμφυτευμένες νευρικές διεπαφές, ενισχυμένα αντανακλαστικά ή αυξημένη δύναμη',

'Μερικά απεικονίζονται με μεταλλικούς εξωσκελετούς που περιβάλλουν το σώμα τους, ',
'δίνοντάς τους μια τρομερή και ρομποτική εμφάνιση. ',
'Αυτοί οι εξωσκελετοί μπορούν να παρέχουν προστασία και αυξημένες φυσικές ικανότητες.',

'έχουν συνήθως ορατή τεχνολογία ενσωματωμένη στο σώμα τους,', 
'όπως καλώδια, κυκλώματα και ηλεκτρονικά εξαρτήματα. ',
'Αυτά τα στοιχεία μπορεί να είναι εκτεθειμένα ',
'ή μερικώς κρυμμένα κάτω από το συνθετικό δέρμα.',

'μπορεί να απαιτεί μια πηγή ενέργειας για να λειτουργήσει,' ,
'η οποία θα μπορούσε να απεικονιστεί',
'ως ένας λαμπερός ενεργειακός πυρήνας, ',
'ορατά καλώδια που συνδέονται σε πρίζες ',
'ή άλλα στοιχεία που σχετίζονται με την τροφοδοσία.',


'Παρά τα μηχανικά τους στοιχεία, εξακολουθούν να μεταφέρουν συναισθήματα ',
'μέσω των εκφράσεων του προσώπου ή της γλώσσας του σώματός τους, ',
'αν και αυτό μπορεί να είναι πιο περιορισμένο σε σύγκριση με τους ανθρώπους.'

];

var fade;
var fadeAmount = 1

let capture;


function preload() {
  // leaf=loadImage("leaf.png");
  // tree=loadImage("tree.jpg");
  // nest=loadImage("nest.jpg");


}

function setup() {
  createCanvas(windowWidth, windowHeight);
  frameRate(0.25);
  push();
  tint(255, 200);
  // image(tree,0,0);
  pop();
  fill('white');
  textSize(16);
  textAlign(CENTER);

  textFont('monospace');
  let thought = random(thoughts);
  text(thought, width / 2, height / 2);
  background(0);
  setInterval(clearText, 10000);

  angleMode(DEGREES);

  capture = createCapture(VIDEO);
  capture.size(1920, 1080);
  capture.hide();



}

function draw() {
//   background(0);



  //angleMode(DEGREES);
  push();
  tint(255, 10);
  scale(random(1, 1.5));
//   rotate(random(-10,10));
imageMode(CENTER);
  
image(capture, width/2, height/2, 1920, 1080);
filter(BLUR);
  // imageMode(CENTER);
  // image(tree, random(width),random(height));
   pop();
  let thought = random(thoughts);
  textAlign(LEFT);
  // text(thought,random(10,width-100),random(height-10));
  let i=Math.floor(Math.random() * thoughts.length);
//   console.log()
  text(thoughts[i], random(16, width-thoughts[i].length*16+16,), random(height / 8, 7 * height / 8,));
//   text(thoughts[i], random(width / 8, 7 * width / 8,), random(height / 8, 7 * height / 8,));
//   text(thoughts[i], random(width / 8, 7 * width / 8,), random(height / 8, 7 * height / 8,));



}

function clearText() {
//   clear();
  background(0);
  console.log('cleared')
push();
  tint(255, 20);


  imageMode(CENTER);
  
  image(capture, width/2, height/2, 1920, 1080);
  filter(BLUR,3);

  // push();
  // tint(255, 200);

  // image(tree,0,0);
  pop();


  // imageMode(CENTER);
  // image(nest,width/2,height/2);
  let thought = random(thoughts);
  text(thought, random(10, width - 100), random(height - 10));
  //text('we escaped in a bug of time',width/4,height/2+36);
}


function windowResized() {
  resizeCanvas(windowWidth, windowHeight);

}